In [54]:
import pandas as pd

pd.set_option("display.max_columns", None)

In [55]:
data = {
    'Nombre': ['Ana', 'Luis', 'Sofia', 'Carlos', 'María'],
    'Edad': [23, 21, 22, 24, 20],
    'Carrera': ['Ingeniería', 'Medicina', 'Arquitectura', 'Derecho', 'Psicología'],
    'Promedio': [9.1, 8.5, 8.7, 9.0, 9.3],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla', 'Bilbao']
}


df = pd.DataFrame(data)
df.head()

   Nombre  Edad       Carrera  Promedio     Ciudad
0     Ana    23    Ingeniería       9.1     Madrid
1    Luis    21      Medicina       8.5  Barcelona
2   Sofia    22  Arquitectura       8.7   Valencia
3  Carlos    24       Derecho       9.0    Sevilla
4   María    20    Psicología       9.3     Bilbao

**Uso de loc e iloc**

In [56]:
df.iloc[1, 1:3]   #Usamos iloc para sacar el valor 21 y Medicina

Edad             21
Carrera    Medicina
Name: 1, dtype: object

In [57]:
df.iloc[:,3] #Queremos la columna promedio

0    9.1
1    8.5
2    8.7
3    9.0
4    9.3
Name: Promedio, dtype: float64

In [58]:
df.loc[4, ["Nombre", "Carrera"]]  #Usando loc queremos sacar María y psicología

Nombre          María
Carrera    Psicología
Name: 4, dtype: object

In [59]:
df = pd.DataFrame(data, index= ["al1", "al2", "al3", "al4", "al5"])  #Usamos index para poner los índices que queramos (para q sea más facil)
df.head()

     Nombre  Edad       Carrera  Promedio     Ciudad
al1     Ana    23    Ingeniería       9.1     Madrid
al2    Luis    21      Medicina       8.5  Barcelona
al3   Sofia    22  Arquitectura       8.7   Valencia
al4  Carlos    24       Derecho       9.0    Sevilla
al5   María    20    Psicología       9.3     Bilbao

In [60]:
df.loc["al1", ["Carrera", "Promedio"]]        #Usando loc con el nuevo index

Carrera     Ingeniería
Promedio           9.1
Name: al1, dtype: object

In [61]:
df.iloc[0, 2:4]    #Usando iloc con el nuevo index

Carrera     Ingeniería
Promedio           9.1
Name: al1, dtype: object

In [62]:
df.iloc[:, 2:5]     #Usando iloc recuerda que el último número del rango no lo incluye
df.iloc[:, -3:]    #Para que nos coja todos no ponemos -1 porque sino Ciudad no lo coge

          Carrera  Promedio     Ciudad
al1    Ingeniería       9.1     Madrid
al2      Medicina       8.5  Barcelona
al3  Arquitectura       8.7   Valencia
al4       Derecho       9.0    Sevilla
al5    Psicología       9.3     Bilbao

In [63]:
df.iloc[[2,4], :]    #Para que nos coja todas las columnas de María y Sofía

    Nombre  Edad       Carrera  Promedio    Ciudad
al3  Sofia    22  Arquitectura       8.7  Valencia
al5  María    20    Psicología       9.3    Bilbao

In [64]:
df.iloc[::2, :]   #Para que nos coja todas las columnas de Ana, María y Sofía [START, STOP STEP]=[:, :, 2]

    Nombre  Edad       Carrera  Promedio    Ciudad
al1    Ana    23    Ingeniería       9.1    Madrid
al3  Sofia    22  Arquitectura       8.7  Valencia
al5  María    20    Psicología       9.3    Bilbao

*Los EDA = EXPLORATORY DATA ANALYSIS*

***TRUCO: SI TE DEVUELVE ALGO ES Q NO SE HA GUARDADO, SI NO TE DEVUELVE NADA ES Q SE HA GUARDADO***

In [65]:
df_ibm= pd.read_csv("datos\IBM_HR_Employee_Attrition_full.csv", index_col= 7)   #Esta es la ruta relativa porque la ruta absoluta es en la que sale UserJaime etc (Y es mala practica tilizarlo porque otros users no van a poder acceder)
                                                                                #Index_col = 7 (El 7 es indicador de columna q quiero convertir a índice) es para poner la columna 0 (Que era un identificador de filas) y convertirlo en nuestro índice
df_ibm.drop(columns= ["Unnamed: 0"], inplace = True)                                 #Esto es para eliminar una columna del archivo csv (No se modifica el original al no ser que lo guarde) el inplace sirve para guardar los cambios (A nivel poder usarlo sin la columna un,amed: 0)

df_ibm.head(2)              #Predeterminado 5 filas si quiero 2 hay que ponerle
df_ibm.tail(3)              #Predeterminado 5 filas si quiero 3 hay que ponerle
df_ibm.sample(4)             #Predeterminado 1 fila si quiero 4 hay que ponerle

,DistanceFromHome,Education,EducationField,Gender,MaritalStatus,Age,DateEmployment,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,TotalWorkingYears,Over18,NumCompaniesWorked,Country,Sons,Attrition,BusinessTravel,DailyRate,Department,EmployeeCount,HourlyRate,JobLevel,JobRole,MonthlyIncome,MonthlyRate,OverTime,PercentSalaryHike,StandardHours,StockOptionLevel,TrainingTimesLastYear,EnvironmentSatisfaction,JobInvolvement,JobSatisfaction,PerformanceRating,RelationshipSatisfaction
EmployeeId,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
002aa91f-b932-442d-b4fd-87e9538e27da,5,Master,Marketing,Male,Single,46,2004-03-12 08:15:52,9,0,5,14,Y,4.0,Suiza,1,No,Travel_Frequently,1211.0,Sales,1,98,2,Sales Executive,5772,20445,Yes,21,80.0,0,4,Low,High,Very High,Outstanding,High
4a8ae548-9161-4992-8ff0-ba4b9c64c9b4,28,Bachelor,Medical,Female,Single,43,2013-02-02 13:53:51,7,1,1,18,Y,4.0,Florida,0,No,Travel_Frequently,957.0,Research & Development,1,72,1,Research Scientist,4739,16090,No,12,80.0,0,2,Medium,Very High,High,Excellent,Very High
1b45f03a-2df5-4109-8d65-b0a7974475f2,3,Master,Medical,Male,Married,29,2006-01-07 04:59:54,14,0,1,10,NaN,1.0,Finlandia,1,No,Travel_Rarely,986.0,Research & Development,1,93,3,Research Director,11935,21526,No,18,80.0,0,2,Medium,Medium,NaN,Excellent,High
172b592f-3979-4da0-aae3-7f5beea9b748,3,College,Medical,Female,Married,39,2016-03-15 15:18:33,0,0,0,12,Y,4.0,Francia,0,Yes,Travel_Rarely,1162.0,Sales,1,41,2,Sales Executive,5238,17778,Yes,18,80.0,0,3,Very High,High,High,Excellent,Low

In [66]:
df_ibm.shape    #Nos muestra el tamaño (1470 employ ID (es decir filas (aunque hay q comprobar que no haya duplicados)) y 35 columnas)

(1470, 35)

**Elegir columnas**

In [67]:
df_ibm.columns                 #Nos muestra todos los nombres de las columnas
df2= df_ibm.loc[:, ["DistanceFromHome", "Age", "RelationshipSatisfaction"]]            #Esto es para seleccionar las columnas q quiero
df_ibm[["DistanceFromHome", "Age", "RelationshipSatisfaction"]]          #Si solo nos interesa elegir columnas esta sintaxis nos vale

,DistanceFromHome,Age,RelationshipSatisfaction
EmployeeId,,,
70b8db40-4f58-476f-8776-c00802b0cdb9,21,19,Medium
0722da7a-530b-41dd-b705-c79f7627f677,25,30,Medium
b5fed13f-7785-4daf-bb8c-1037f84e5fa7,1,22,Very High
4b0a1169-b286-44fb-a453-b97ca934db57,4,42,Very High
6affb754-8e52-43a7-9e97-4e373ef5fccb,2,36,High
...,...,...,...
ee51e04a-ae21-423f-91ae-bd85c93ed69d,1,30,Very High
7229488d-28e5-4e95-8df4-d83c5c110722,7,39,Low
d612a787-00ab-4769-a965-2b4a625b27d9,4,24,High
7261478d-ea6b-4588-b803-5807218f3a00,2,25,High
34320d20-cf61-4900-9450-c8539f23b355,5,31,High

**Duplicados**

In [68]:
df_ibm.duplicated()                   #Esto nos da una serie q dice si los datos están duplicados (mira si toda la fila está duplicada (es decir que haya otra fila exactamente igual) poniendo false y true si se ha encontrad q es igual a alguna fila que estaba más arriba
df_ibm.duplicated().sum()             #Esto nos daría el número de duplicados

np.int64(0)

**Cambiar la columna de indice de vuelta a como era**

In [71]:
df_ibm.reset_index(inplace= True)        #El inplace es para que se guarde Este reset es para volver a tener employee ID como columna (EL RESET SOLO SE PUEDE EJECUTAR UNA VEZ PORQUE SI NO SIGUE GENERANDO(SI SE EJECUTA REPETIDO HAY Q EJECUTAR TODO EL JUPYTER))
df_ibm.head()

,EmployeeId,DistanceFromHome,Education,EducationField,Gender,MaritalStatus,Age,DateEmployment,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,TotalWorkingYears,Over18,NumCompaniesWorked,Country,Sons,Attrition,BusinessTravel,DailyRate,Department,EmployeeCount,HourlyRate,JobLevel,JobRole,MonthlyIncome,MonthlyRate,OverTime,PercentSalaryHike,StandardHours,StockOptionLevel,TrainingTimesLastYear,EnvironmentSatisfaction,JobInvolvement,JobSatisfaction,PerformanceRating,RelationshipSatisfaction
0,70b8db40-4f58-476f-8776-c00802b0cdb9,21,Bachelor,Other,Male,Single,19,2000-01-13 02:53:47,14,0,0,1,NaN,1.0,Austria,1,Yes,Travel_Rarely,419.0,Sales,1,37,1,Sales Representative,2121,9947,Yes,13,80.0,0,3,Very High,Medium,Medium,Excellent,Medium
1,0722da7a-530b-41dd-b705-c79f7627f677,25,College,Technical Degree,Female,Married,30,2000-01-17 03:53:10,16,0,0,4,Y,7.0,España,1,No,Non-Travel,641.0,Sales,1,85,2,Sales Executive,4736,6069,Yes,12,80.0,1,2,Very High,High,High,Excellent,Medium
2,b5fed13f-7785-4daf-bb8c-1037f84e5fa7,1,College,Life Sciences,Male,Single,22,2000-01-21 05:42:21,20,0,0,4,Y,0.0,República Checa,1,No,Travel_Rarely,581.0,Research & Development,1,63,1,Research Scientist,3375,17624,No,12,80.0,0,2,Very High,High,High,Excellent,Very High
3,4b0a1169-b286-44fb-a453-b97ca934db57,4,College,Technical Degree,Male,Married,42,2000-01-28 16:59:19,11,1,5,22,NaN,1.0,Misisipi,1,No,Travel_Rarely,532.0,Research & Development,1,58,5,Manager,19232,4933,No,11,80.0,0,3,High,High,Very High,Excellent,Very High
4,6affb754-8e52-43a7-9e97-4e373ef5fccb,2,Master,Life Sciences,Female,Single,36,2000-02-02 22:58:25,13,0,7,17,NaN,3.0,Portugal,1,No,Travel_Rarely,530.0,Sales,1,51,2,Sales Representative,4502,7439,No,15,80.0,0,2,High,High,Very High,Excellent,High

In [73]:
#df_ibm.set_index("EmployeeId", inplace= True)         # El .set_index sirve para volver a poner "EmployeeId como índice"

**Comprobar duplicados en una sola columna**

In [74]:
df_ibm.duplicated(subset = "EmployeeId").sum()    #Esto es para comprobar duplicados en una sola columna

np.int64(0)

In [84]:
df_ibm.duplicated(subset = ["Eduction", "Gender"]).sum()  #Esto es para comprobar duplicados en una dos columnas

KeyError: Index(['Eduction'], dtype='object')

In [78]:
df_ibm.drop_duplicates(subset = ["Gender", "Eduction"], keep = "last")    #Esto es para eliminar los duplicados y el keep par PENDIENTE DE COMPLETAR

KeyError: Index(['Eduction'], dtype='object')

In [85]:
df_sin_duplicados= df_ibm.drop_duplicates(keep= "last")       #Esto es para eliminar PENDIENTE DE COMPLETAR

In [88]:
df_sin_duplicados.reset_index(drop= True, inplace= True)   #PENDIENTE DE COMPLETAR
df_sin_duplicados.head()

,EmployeeId,DistanceFromHome,Education,EducationField,Gender,MaritalStatus,Age,DateEmployment,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,TotalWorkingYears,Over18,NumCompaniesWorked,Country,Sons,Attrition,BusinessTravel,DailyRate,Department,EmployeeCount,HourlyRate,JobLevel,JobRole,MonthlyIncome,MonthlyRate,OverTime,PercentSalaryHike,StandardHours,StockOptionLevel,TrainingTimesLastYear,EnvironmentSatisfaction,JobInvolvement,JobSatisfaction,PerformanceRating,RelationshipSatisfaction
0,70b8db40-4f58-476f-8776-c00802b0cdb9,21,Bachelor,Other,Male,Single,19,2000-01-13 02:53:47,14,0,0,1,NaN,1.0,Austria,1,Yes,Travel_Rarely,419.0,Sales,1,37,1,Sales Representative,2121,9947,Yes,13,80.0,0,3,Very High,Medium,Medium,Excellent,Medium
1,0722da7a-530b-41dd-b705-c79f7627f677,25,College,Technical Degree,Female,Married,30,2000-01-17 03:53:10,16,0,0,4,Y,7.0,España,1,No,Non-Travel,641.0,Sales,1,85,2,Sales Executive,4736,6069,Yes,12,80.0,1,2,Very High,High,High,Excellent,Medium
2,b5fed13f-7785-4daf-bb8c-1037f84e5fa7,1,College,Life Sciences,Male,Single,22,2000-01-21 05:42:21,20,0,0,4,Y,0.0,República Checa,1,No,Travel_Rarely,581.0,Research & Development,1,63,1,Research Scientist,3375,17624,No,12,80.0,0,2,Very High,High,High,Excellent,Very High
3,4b0a1169-b286-44fb-a453-b97ca934db57,4,College,Technical Degree,Male,Married,42,2000-01-28 16:59:19,11,1,5,22,NaN,1.0,Misisipi,1,No,Travel_Rarely,532.0,Research & Development,1,58,5,Manager,19232,4933,No,11,80.0,0,3,High,High,Very High,Excellent,Very High
4,6affb754-8e52-43a7-9e97-4e373ef5fccb,2,Master,Life Sciences,Female,Single,36,2000-02-02 22:58:25,13,0,7,17,NaN,3.0,Portugal,1,No,Travel_Rarely,530.0,Sales,1,51,2,Sales Representative,4502,7439,No,15,80.0,0,2,High,High,Very High,Excellent,High

In [89]:
df_sin_duplicados["Gender"].unique()   #Para comprobar los valores únicos en la columna Gender

array(['Male', 'Female'], dtype=object)

In [90]:
df_sin_duplicados["EducationField"].unique()     #Para comprobar los valores únicos en la columna EducationField

array(['Other', 'Technical Degree', 'Life Sciences', 'Medical',
       'Marketing', 'Human Resources'], dtype=object)

In [91]:
df_sin_duplicados.dtypes             #Nos da los tipos de datos que hay en cada columna (los str pasan a llamarse object)

EmployeeId                   object
DistanceFromHome              int64
Education                    object
EducationField               object
Gender                       object
MaritalStatus                object
Age                           int64
DateEmployment               object
YearsInCurrentRole            int64
YearsSinceLastPromotion       int64
YearsWithCurrManager          int64
TotalWorkingYears             int64
Over18                       object
NumCompaniesWorked          float64
Country                      object
Sons                          int64
Attrition                    object
BusinessTravel               object
DailyRate                   float64
Department                   object
EmployeeCount                 int64
HourlyRate                    int64
JobLevel                      int64
JobRole                      object
MonthlyIncome                 int64
MonthlyRate                   int64
OverTime                     object
PercentSalaryHike             int64
StandardHours               float64
StockOptionLevel              int64
TrainingTimesLastYear         int64
EnvironmentSatisfaction      object
JobInvolvement               object
JobSatisfaction              object
PerformanceRating            object
RelationshipSatisfaction     object
dtype: object

**Ver las categorias de cada columna**

In [105]:
for columns in df_sin_duplicados.select_dtypes("object").columns:       #Para cseleccionar un tipo concreto de dato
    print(columns)
    print(df_sin_duplicados[columns].unique())                          #Los nulos en pandas aparecen como nan y habrá que limpiarlos
    print(f"----------------------------\n")

EmployeeId
['70b8db40-4f58-476f-8776-c00802b0cdb9'
 '0722da7a-530b-41dd-b705-c79f7627f677'
 'b5fed13f-7785-4daf-bb8c-1037f84e5fa7' ...
 'd612a787-00ab-4769-a965-2b4a625b27d9'
 '7261478d-ea6b-4588-b803-5807218f3a00'
 '34320d20-cf61-4900-9450-c8539f23b355']
----------------------------

Education
['Bachelor' 'College' 'Master' 'Below College' nan 'Doctor']
----------------------------

EducationField
['Other' 'Technical Degree' 'Life Sciences' 'Medical' 'Marketing'
 'Human Resources']
----------------------------

Gender
['Male' 'Female']
----------------------------

MaritalStatus
['Single' 'Married' 'Divorced']
----------------------------

DateEmployment
['2000-01-13 02:53:47' '2000-01-17 03:53:10' '2000-01-21 05:42:21' ...
 '2022-12-14 21:58:45' '2022-12-27 21:53:23' '2022-12-30 07:15:12']
----------------------------

Over18
[nan 'Y']
----------------------------

Country
['Austria' 'España' 'República Checa' 'Misisipi' 'Portugal' 'Noruega'
 'Italia' 'Bélgica' 'Croacia' 'Grecia' 'Wyoming' 'Delaware' 'Texas' 'Iowa'
 'Finlandia' 'Utah' 'Dinamarca' 'Indiana' 'Maine' 'California' 'Alaska'
 'Suecia' 'Illinois' 'Montana' 'Maryland' 'New Hampshire' 'Ohio'
 'Dakota del Norte' 'Rumania' 'Colorado' 'Vermont' 'Kentucky' 'Kansas'
 'Pensilvania' 'Suiza' 'Minnesota' 'Nueva Jersey' 'Francia' 'Reino Unido'
 'Carolina del Norte' 'Polonia' 'Massachusetts' 'Arizona' 'Nebraska'
 'Florida' 'Países Bajos' 'Alemania' 'Georgia' 'Misuri' 'Washington'
 'Tennessee' 'Oklahoma' 'Nevada' 'Connecticut' 'Arkansas' 'Hungría'
 'Dakota del Sur' 'Luisiana' 'Wisconsin' 'Michigan' 'Rhode Island'
 'Carolina del Sur' 'Nuevo México' 'Virginia' 'Nueva York' 'Idaho'
 'Alabama' 'Oregón' 'Virginia Occidental' 'Hawaii']
----------------------------

Attrition
['Yes' 'No']
----------------------------

BusinessTravel
['Travel_Rarely' 'Non-Travel' 'Travel_Frequently' nan]
----------------------------

Department
['Sales' 'Research & Development' 'Human Resources']
----------------------------

JobRole
['Sales Representative' 'Sales Executive' 'Research Scientist' 'Manager'
 'Laboratory Technician' 'Healthcare Representative' 'Research Director'
 'Manufacturing Director' 'Human Resources']
----------------------------

OverTime
['Yes' 'No']
----------------------------

EnvironmentSatisfaction
['Very High' 'High' 'Low' 'Medium']
----------------------------

JobInvolvement
['Medium' 'High' 'Very High' 'Low']
----------------------------

JobSatisfaction
['Medium' 'High' 'Very High' 'Low' nan]
----------------------------

PerformanceRating
['Excellent' 'Outstanding']
----------------------------

RelationshipSatisfaction
['Medium' 'Very High' 'High' 'Low' nan]
----------------------------

**Ver valores en cada categoría o sus proporciones**

In [106]:
for columns in df_sin_duplicados.select_dtypes("object").columns:       #Para seleccionar un tipo concreto de dato
    print(columns)
    print(df_sin_duplicados[columns].value_counts() / df_sin_duplicados.shape(0))                          #No salen los nulos en value counts. Y nos da los values de cada tipo dentro de cada columna 
    print(f"----------------------------\n")                                                               #df_sin_duplicados.shape(0) es para conseguir las proporciones respecto al total (Tambien se puede poner value_counts(normalized= True) y haría lo mismo pero peor porque no contaría los nulos)

EmployeeId
EmployeeId
34320d20-cf61-4900-9450-c8539f23b355    1
70b8db40-4f58-476f-8776-c00802b0cdb9    1
0722da7a-530b-41dd-b705-c79f7627f677    1
b5fed13f-7785-4daf-bb8c-1037f84e5fa7    1
4b0a1169-b286-44fb-a453-b97ca934db57    1
                                       ..
9f414465-76a0-43ac-8fe5-3bce11183bf1    1
dc9e265c-6915-4805-b272-f3354ea07f32    1
b890a7d2-2d53-4570-a8cc-56d4f2ca9065    1
2b8f1f1e-3c57-4141-aadb-50d4a258bc72    1
c5824d7b-9539-4de7-9308-c05472a4afdf    1
Name: count, Length: 1470, dtype: int64
----------------------------

Education
Education
Bachelor         479
Master           353
College          243
Below College    142
Doctor            43
Name: count, dtype: int64
----------------------------

EducationField
EducationField
Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: count, dtype: int64
----------------------------

Gender
Gender
Male      882
Female    588
Name: count, dtype: int64
----------------------------

MaritalStatus
MaritalStatus
Married     673
Single      470
Divorced    327
Name: count, dtype: int64
----------------------------

DateEmployment
DateEmployment
2001-12-21 11:10:19    2
2009-09-18 08:56:26    2
2005-03-27 00:39:36    2
2022-08-17 05:02:36    1
2000-03-20 05:07:49    1
                      ..
2022-07-18 17:22:45    1
2022-07-19 08:08:35    1
2022-07-30 11:40:38    1
2022-08-14 15:21:27    1
2022-08-22 02:25:05    1
Name: count, Length: 1467, dtype: int64
----------------------------

Over18
Over18
Y    1161
Name: count, dtype: int64
----------------------------

Country
Country
Noruega         46
Francia         45
Dinamarca       41
Países Bajos    41
Polonia         40
                ..
Rhode Island     9
Idaho            9
Arkansas         9
Nueva York       9
Oklahoma         8
Name: count, Length: 70, dtype: int64
----------------------------

Attrition
Attrition
No     1233
Yes     237
Name: count, dtype: int64
----------------------------

BusinessTravel
BusinessTravel
Travel_Rarely        941
Travel_Frequently    250
Non-Travel           132
Name: count, dtype: int64
----------------------------

Department
Department
Research & Development    961
Sales                     446
Human Resources            63
Name: count, dtype: int64
----------------------------

JobRole
JobRole
Sales Executive              326
Research Scientist           292
Laboratory Technician        259
Manufacturing Director       145
Healthcare Representative    131
Manager                      102
Sales Representative          83
Research Director             80
Human Resources               52
Name: count, dtype: int64
----------------------------

OverTime
OverTime
No     1054
Yes     416
Name: count, dtype: int64
----------------------------

EnvironmentSatisfaction
EnvironmentSatisfaction
High         453
Very High    446
Medium       287
Low          284
Name: count, dtype: int64
----------------------------

JobInvolvement
JobInvolvement
High         868
Medium       375
Very High    144
Low           83
Name: count, dtype: int64
----------------------------

JobSatisfaction
JobSatisfaction
Very High    400
High         381
Low          257
Medium       241
Name: count, dtype: int64
----------------------------

PerformanceRating
PerformanceRating
Excellent      1244
Outstanding     226
Name: count, dtype: int64
----------------------------

RelationshipSatisfaction
RelationshipSatisfaction
High         450
Very High    423
Medium       297
Low          269
Name: count, dtype: int64
----------------------------

**Nulos nan**